package world.dahua.leetcode;

public class Question2750 {

    /**
     * num: 2750
     * <p>
     * 给你一个二元数组 nums 。
     * <p>
     * 如果数组中的某个子数组 恰好 只存在 一 个值为 1 的元素，则认为该子数组是一个 好子数组 。
     * <p>
     * 请你统计将数组 nums 划分成若干 好子数组 的方法数，并以整数形式返回。由于数字可能很大，返回其对 109 + 7 取余 之后的结果。
     * <p>
     * 子数组是数组中的一个连续 非空 元素序列。
     * <p>
     * <p>
     * <p>
     * 示例 1：
     * <p>
     * 输入：nums = [0,1,0,0,1]
     * 输出：3
     * 解释：存在 3 种可以将 nums 划分成若干好子数组的方式：
     * - [0,1] [0,0,1]
     * - [0,1,0] [0,1]
     * - [0,1,0,0] [1]
     * 示例 2：
     * <p>
     * 输入：nums = [0,1,0]
     * 输出：1
     * 解释：存在 1 种可以将 nums 划分成若干好子数组的方式：
     * - [0,1,0]
     * <p>
     * <p>
     * 提示：
     * <p>
     * 1 <= nums.length <= 105
     * 0 <= nums[i] <= 1
     */
    static void main() {
        Question2750 question = new Question2750();
        long begin = System.currentTimeMillis();
        System.out.println(question.numberOfGoodSubarraySplits(new int[]{0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0}));
        System.out.println("Cost: " + (System.currentTimeMillis() - begin) + "ms");
    }

    public int numberOfGoodSubarraySplits(int[] nums) {
        boolean allow = false;
        long res = 1L;
        int zero = 0;
        for (int num : nums) {
            if (num == 1) {
                if (allow) {
                    res = res * (zero + 1) % 1000000007;
                }
                if (!allow) {
                    allow = true;
                }
                zero = 0;
            } else {
                zero++;
            }
        }
        if (!allow) {
            res = 0;
        }
        return new Long(res).intValue();
    }
}
